{
    "_comment": "https://confluence/display/TRAC/Big+Data+Engineer",

    "type": "BI - Big Data Engineer",
    "version": "2.0.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Drives the Business": {
            "competencies": {
                "BDE": {
                    "category": "Skill",
                    "competency": "Drives the Business",
                    "examples": {
                        "0": "Does not consistently exhibit anything from 1-3",
                        "1": "Follows best practices as outlined by the team as it relates to development. Follows software development life-cycle (source control, change management) Understands core SQL syntax and can take a documented business problem and translate it to SQL with accurate results. Understands how to create database objects (stored procedures, tables, views, etc.) Modifies existing solutions in respective specialty (applications, SSIS, SSAS, SQL, Tableau, SSRS, etc. ) Creates basic scripts for data processing and exploration. Modifies ELT processes, using Big Data integration tools, to bring in new data elements. Makes modifications to existing Hive tables ",
                        "2": "Activity identifies and makes recommendations for improvements in our engineering processes. Identifies and resolves roll-specific on-call responsibilities (short-term fixes) Jumps in to code they did not write and can interpret and debug it. Profiles data, looking for inconsistencies and completeness. Performance tunes SQL queries. Implements performance strategies (indexes, query optimization, scaling strategies , etc.) Explores and implements new tools and technology. Understands inter system dependencies. Actively pair programs with other engineers. Follows design patterns that the team has established. Creates new ELT processes that integrates with source systems and bring data into Big Data cluster. Knowledge of Map-Reduce for scalable data processing. Create new data structures (Hive or HBase) that meets the demands of the problem. Create monitoring scripts to ensure visibly into processes",
                        "3": "Breaks down complex code in to simpler solutions (i.e. refactoring code, table structures, etc.) Creates, automates and implements improvements to our engineering processes. Establishes standards best practices for the team. Promotes pair programming. Implements root-cause resolution to on-call issues (long-term fixes) Leverages advanced debugging techniques and tools and promotes them. Shares and holds the team accountable for following standards and best practices. Identified and Resolves security flaws / solutions. Establishes benchmarks for our solutions (applications, data sets, ETLs, etc.) Implements advanced performance strategies (partitioning, compression, etc.) Creates dimensional models that represents the business domain. Understanding of and some experience building in our client facing tools (i.e. Tableau, SSRS)"
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
