{
    "_comment": "https://confluence/display/TRAC/BI+Business+Analyst",

    "type": "BI - Business Analyst",
    "version": "2.0.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Empowers the Business": {
            "competencies": {
                "E1": {
                    "category": "Skill",
                    "competency": "Empowers the Business",
                    "examples": {
                        "0": "0 - Does not consistently exhibit anything from 1-3",
                        "1": "Clearly understands and articulates the problem that we are trying to solve. Documents requirements in a manner that results in clearly defined and accurate user stories, tech specs, and acceptance criteria. Finds and speaks to current status for a business partner’s request Awareness of existing solutions and technology. Follows pre-written test scripts to effectively and thoroughly test changes to applications or data Actively solicits feedback from peers in validating and reviewing proposed solutions",
                        "2": "Clearly understands and articulates why the work that we are doing is important. Identifies all impacted stakeholders Understanding of existing solutions and technology. Determines the appropriate scenarios required to test changes to applications or data and effectively documents the steps to complete the testing. Leverages test data in our lesser environments and source systems. Proactively communicates with the business in the right time the priority and status of their request. Stays close to project team and makes sure tasks are on track and all team members have what they need. Makes sure stand-ups, backlog grooming, prioritization and retrospective meetings occur regularly and are efficient and productive. Produces clear technical specifications leveraging templates and standards of the BI BA community.. Documents solutions and definitions Produces clear user stories and acceptance criteria leveraging templates and standards of the BI BA community.",
                        "3": "Actively engages peers to mentor and offer best practice guidance. Assists team in breaking down epics into features to help better define stories required. Able to effectively document project level work which includes multiple parallel streams of effort. Recommends best client-facing solution based on business questions. Recommends best data integration method based on business questions, frequency, and velocity of change.. Defines testing strategies across BI and promotes efficiency and best practices where identified. Proactively approaches business partners with new impactful recommendations Establishes relationships with IT teams who have upstream/downstream dependencies to team's body of work. Follows-up with business partners for feedback on prior solutions provided. Stays close to the iteration to jump in when needed or find additional resources. Able to document current and future state processes and data flow diagrams Evolves BA templates and standards within our BI BA community"
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
