{
    "_comment": "https://confluence/display/TRAC/BI+Engineer",

    "type": "BI - Engineer",
    "version": "2.0.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Empowers the Business": {
            "competencies": {
                "BIE": {
                    "category": "Skill",
                    "competency": "Empowers the Business",
                    "examples": {
                        "0": "Does not consistently exhibit anything from 1-3",
                        "1": "Follows best practices as outlined by the team as it relates to development. Follows software development life-cycle (source control, change management). Understands core SQL syntax and can take a documented business problem and translate it to SQL with accurate results.. Understands how to create database objects (stored procedures, tables, views, etc.). Modifies existing solutions in respective specialty (applications, SSIS, SSAS, SQL, Tableau, SSRS, etc. ) ",
                        "2": "Activity identifies and makes recommendations for improvements in our engineering processes. Identifies and resolves roll-specific on-call responsibilities (short-term fixes). Jumps in to code they did not write and can interpret and debug it.. Profiles data, looking for inconsistencies and completeness.. Performance tunes SQL queries. Implements performance strategies (indexes, query optimization, scaling strategies , etc.). Explores and implements new tools and technology. Understands inter system dependencies. Follows design patterns that the team has established. Creates new SSRS reports, or similar reporting solutions, to visualize business insights",
                        "3": "Breaks down complex code in to simpler solutions (i.e. refactoring code, table structures, etc.). Creates, automates and implements improvements to our engineering processes. Establishes standards best practices for the team. Implements root-cause resolution to on-call issues (long-term fixes). Leverages advanced debugging techniques and tools and promotes them. Shares and holds the team accountable for following standards and best practices. Establishes benchmarks for our solutions (applications, data sets, ETLs, etc.). Understanding of and some experience building in our data integration tools (i.e. SSIS, Message Processing). Understanding of and some experience building in our custom platform tools (i.e. BIG, QSlice, etc.)"
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
