{
    "_comment": "https://confluence/display/TRAC/Modeler",

    "type": "BI - Modeler",
    "version": "2.0.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Elevating with Data": {
            "competencies": {
                "M1": {
                    "category": "Skill",
                    "competency": "Elevating with Data",
                    "examples": {
                        "0": "Does not consistently exhibit anything from 1-3",
                        "1": "Proficient in exploratory data analysis, visualization, and reporting of findings to team members and clients. Ability to assemble data from disparate data sources, be able to understand and interpret the data, and to prepare the assembled data for building the model. In depth knowledge of statistical models – simple and multiple linear regression, general linear models, and can draw inference on those models. Capable of performing model development, statistical test and validation of modeling by applying adequate techniques and processes. Some knowledge in basic machine learning techniques. Familiar with SQL Server, statistical analytics software packages such as SAS, R.",
                        "2": "Focused on more advanced analytics and technique, and more complex supervised and unsupervised techniques. Has deep knowledge and experience in randomized statistical sampling techniques and probability sampling techniques. Has mastered data imputation methodologies and variable selection techniques and has the experience in evaluating and selecting the statistical models. Develops more advanced solutions to improve development efficiency and accuracy. Pairs with and mentors other Modelers and Data Scientists on modeling best practices, use cases, and implementations.",
                        "3": "Has developed a technical expertise in the majority of statistical and machine learning techniques. (P) Should be the resident SME in any one area or technique in statistical modeling, machine learning or data science. (P) Executes on specialized technique quickly, efficiently and regardless of business domain. (P) Ability to transfer knowledge in actionable methods and procedures to support company present and future needs. (P) Proactively researches new techniques to learn use cases. (P) Is able to identify, implement and communicate to team members how to use modeling techniques to solve a problem. (P) Is able to communicate the design of a solution to Modelers, Data Scientists and the business and why it is the correct decision to make. (P) Ability to lead and managed the business engagement of their principal area of expertise (P) Is able to set the best practices (identify and design) solutions using a specific set of modeling techniques for specific use cases in the right way. (A) Is able to document and promote the design of solutions to Modelers, Data Scientists and the business. (A) Is able to get buy-in from leaders and development teams when to use a certain techniques. (A) Ability to implement architectural modeling concepts and measure impact and performance to leadership and the company. (A) Develops and maintains visionary architectural direction. (A)"
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
