{
    "_comment": "https://confluence/display/TRAC/Leadership",

    "type": "Leader",
    "version": "0.1.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Driving The Culture": {
            "competencies": {
                "A1": {
                    "category": "Behavior",
                    "competency": "Lives the ISMs",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Has demonstrated a full understanding of the ISMS through actions, words, and behaviors throughout daily situations.",
                      "2": "Has clearly incorporated the ISMs into their core values by practicing the ISMs every day, continuously improving their knowledge and experience of the ISMs through actions, words, and behaviors throughout daily situations.",
                      "3": "Helps others practice the ISMs and ensures we continue to stay who we are through our ISMs by upholding them and teaching others to do the same throughout daily situations.",
                      "4": "Lives our ISMs outside of QL at conferences, recruiting events, on social media, and social events, promoting who we are by representing QL and the team at these events."
                    },
                    "rating": "",
                    "comment": ""
                },
                "A2": {
                    "category": "Behavior",
                    "competency": "Fosters Innovation",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Finds ways to improve themselves, the team, and the business.",
                      "2": "Creates an environment where team members want to and are able to be committed to innovating themselves, their team, and the business, as well as invest time innovating during Bullet Time, Hackathons, Conferences, and other types of innovation time focused on personal, team, and company growth.",
                      "3": "Is committed to innovation by continuously finding ways to improve themselves, the team, and the business, as well as finding ways to participate in innovation time like Bullet Time, Hackathons, Conferences, and Experiments focused on personal, team, and company growth.",
                      "4": "The team takes initiative and consistently demonstrates an innovative mindset by creating innovative solutions that transform our teams and our business."
                    },
                    "rating": "",
                    "comment": ""
                },
                "A3": {
                    "category": "Knowledge",
                    "competency": "Team Cultivation",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Rewards and celebrates important team and team member events, as well as team and team member successes.",
                      "2": "Team members support and work together to solve problems and help each other do what's right.",
                      "3": "Coordinates and attends team events, social hours, team outings, volunteer events, and company events to help strengthen relationships with team members.",
                      "4": "The team takes initiative and is engaged in cultivating the teams culture and mindset by being invested in and coordinating team events, social hours, team outings, volunteer events, and company events to help strengthen relationships with team members."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Building Trust": {
            "competencies": {
                "B1": {
                    "category": "Behavior",
                    "competency": "Builds strong, lasting relationships with others.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Performs one on one's with direct reports.  Gets to know their direct team on a personal level.",
                      "2": "Earns trust of team members by building meaningful relationships, respecting privacy, and maintaining transparency. Creates an environment where team members trust each other.",
                      "3": "Proactively networks and builds relationships across Technology and the business. Utilizes relationships to tie threads between Technology and the business.",
                      "4": "Networks and builds relationships with other leaders across the FOC and technology industry, and leverages those relationships to help us grow."
                    },
                    "rating": "",
                    "comment": ""
                },
                "B2": {
                    "category": "Behavior",
                    "competency": "Takes ownership and is accountable for themselves and for the team.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Takes responsibility for the team's results by leveraging a delivery and prioritization process, and ensures coverage by their team to fit the needs of their business domain.",
                      "2": "Has a high level of ownership and initiative on items relating to their specific business or IT domain.",
                      "3": "Takes the conn on tying the threads between their team and partner teams, and takes interest in the vision and performance of teams outside of their domain.",
                      "4": "Proactively stays engaged with the IT leadership team, and is involved in major initiatives that intersect their teams IT vertical. Ensures that Technology is driving the business."
                    },
                    "rating": "",
                    "comment": ""
                },
                "B3": {
                    "category": "Behavior",
                    "competency": "Has noticeable and admirable presence.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Makes a good first impression.  Displays appropriate levels of confidence and capability. ",
                      "2": "Uses an open and accepting physiology and tone that makes themselves approachable by others, even when extremely busy.",
                      "3": "Maintains composure in front of the team even in very challenging situations, to help the team remain calm.  Stands up for team in times of need and shields them from noise.",
                      "4": "Team members, leaders, and business partners seek them out both professionally and personally. Have the ability to command attention and engage listeners when presenting to large audiences. "
                    },
                    "rating": "",
                    "comment": ""
                },
                "B4": {
                    "category": "Behavior",
                    "competency": "Consistently overcomes obstacles and delivers results.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Demonstrates a high degree of integrity by honoring commitments, and delivering timely results.",
                      "2": "Teaches others how to overcome obstacles in order to achieve personal and team goals. ",
                      "3": "Communicates and ties threads across business and technology teams in order to overcome obstacles, and ensures teams learn from past experiences.",
                      "4": "Anticipates potential issues before they occur by leveraging past experiences. Strategically guides team members toward the most desired outcome for a given situation, so they can do the same in the future."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Developing People": {
            "competencies": {
                "C1": {
                    "category": "Behavior",
                    "competency": "Gives appropriate & timely coaching and feedback.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Provides ongoing feedback to team members, and creates actionable goals and development plans with them.",
                      "2": "Is effective at providing tailored coaching to team members to realize their desired goals and objectives.",
                      "3": "Has proven success by coaching team members and achieving transformational growth. Leads outside his/her role by providing coaching and direct feedback to those outside of their immediate team.",
                      "4": "Keeps an open ear, and provides on the spot feedback when they observe something that warrants praise or constructive coaching. Invests time in mentoring leaders both in and out of their technology vertical."
                    },
                    "rating": "",
                    "comment": ""
                },
                "C2": {
                    "category": "Behavior",
                    "competency": "Sets clear expectations and maintains accountability.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Sets basic expectations up front, such as hours, attire, behavior, etc. Holds self accountable.",
                      "2": "Ensures that each person on their team understands what success looks like for their role. Takes appropriate action when team members do not meet expectations or commitments.",
                      "3": "Develops expectations for team members across teams in broader team initiatives, and ensures that everyone understands the unique role that they play.",
                      "4": "Negotiates expectations and creates alignment across multiple parties with differing points of view."
                    },
                    "rating": "",
                    "comment": ""
                },
                "C3": {
                    "category": "Behavior",
                    "competency": "Builds strong organizational teams.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Forms a team that leverages the strength of each individual. Drives resolution to team dynamic and interpersonal conflicts.",
                      "2": "Effectively leads teams through changes, including forming, storming, norming and performing.",
                      "3": "Grooms a successor for their role, and grows the bench strength of our leadership team.",
                      "4": "Recognizes opportunities within the organizational structure beyond their own team, and drives transformational change."
                    },
                    "rating": "",
                    "comment": ""
                },
                "C4": {
                    "category": "Behavior",
                    "competency": "Equips Team Members with tools and opportunities to grow.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Provides team members with the tools, knowledge, and resources they need to be successful in their current role.",
                      "2": "Gives team members challenging work that develops their natural talents, and connects mentors and mentees. Works with team and team members to set and achieve meaningful goals.",
                      "3": "Seeks out and provides opportunities for team members to experience performing a level up from their current role.",
                      "4": "Looking across the FOC and industry, finds and provides new ways to drive team member and organizational growth."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Strategic Thinking": {
            "competencies": {
                "E1": {
                    "category": "Behavior",
                    "competency": "Organizes high functioning teams.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Ensures the team has the right people, skills, knowledge, and diverse perspectives needed for success.",
                      "2": "Ensures that team has the right process, standards, and collaboration needed to deliver high quality business and technology solutions.",
                      "3": "Constantly reevaluates, and improves team structure and process to ensure it is optimized to meet the current needs of both technology and the business.",
                      "4": "Is able to anticipate where both technology and the business is heading, and proactively adapting the team structure, process, and technology to be ready for it."
                    },
                    "rating": "",
                    "comment": ""
                },
                "E2": {
                    "category": "Behavior",
                    "competency": "Plans Strategically.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Ensures team backlog is groomed, prioritized, and is ready to be worked on at the beginning of each sprint.",
                      "2": "Drives quarterly planning and work break down sessions to prepare their team for future business and technology initiatives.",
                      "3": "Ensures that the team has a road map that makes it clear where they're going well into the future.",
                      "4": "Coordinates dependencies across multiple technology, business, and FOC teams to deliver on epic level initiatives."
                    },
                    "rating": "",
                    "comment": ""
                },
                "E3": {
                    "category": "Behavior",
                    "competency": "Adapts to Change",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Demonstrates to the team that change is good by being open and flexible.",
                      "2": "Leads team through problem solving when road blocks exist. Provides a framework enabling team members to make effective and timely decisions.",
                      "3": "Can shift priorities to adapt to variable needs from our business, clients, other teams, and the business market.",
                      "4": "Has a pulse on their external environment. Understands when to react to change, when not to react to change and when to lead change, and executes effectively."
                    },
                    "rating": "",
                    "comment": ""
                },
                "E4": {
                    "category": "Behavior",
                    "competency": "Effective Decision Maker.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Understands the business, technology, and clients of the team well enough to make decisions that impact the company.",
                      "2": "Understands where their business and IT as a whole is going and makes decisions based on an aligned vision and roadmap.",
                      "3": "Knows how their team and systems impact partner teams, other systems, and the FOC. Leverages both IFR and VFR to measure performance and make decisions.",
                      "4": "Challenges our teams to look beyond what we know and what we do today, to make decisions that reflect what is possible in a future state based on industry and FOC knowledge."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Communicating Effectively": {
            "competencies": {
                "D1": {
                    "category": "Behavior",
                    "competency": "Paints a clear vision.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Speak to the focus of their team(s) and provide clarity to the areas of the business impacted.",
                      "2": "Is able to clearly communicate what the teams need to do and why it is important, and ensures the team understands the business impact of the solutions implemented.",
                      "3": "Effectively promotes their team vision to other teams, is able to market their team's vision to get buy-in with leadership across the enterprise.",
                      "4": "Is able to get buy-in on the overall direction of their team's vision, while maintaining alignment with leadership, business partners, and team members."
                    },
                    "rating": "",
                    "comment": ""
                },
                "D2": {
                    "category": "Behavior",
                    "competency": "Takes ownership of their communication.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Delivers messages in a timely fashion; acts with a sense of urgency.",
                      "2": "Proactively communicates critical information to the right people, and ensures that \"message sent\" is \"message received\". Takes ownership of mistakes, and effectively leverages the three step process.",
                      "3": "Creates environment of proactive communication within their team, and fosters ownership of communication on the individual level.",
                      "4": "Mediates, diffuses, and resolves conflict between any combination of teams, team members, and business partners."
                    },
                    "rating": "",
                    "comment": ""
                },
                "D3": {
                    "category": "Behavior",
                    "competency": "Aware of the communication needs of others.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Selects the appropriate delivery method, and is effective at crafting a message.",
                      "2": "Recognizes how words, tone and physiology impacts results then adapts accordingly.",
                      "3": "Ensures team members are effective at selecting the right delivery method, and crafting a message.",
                      "4": "Demonstrates active listening to team members in their words, tone, and body language, and effectively seeks to understand."
                    },
                    "rating": "",
                    "comment": ""
                },
                "D4": {
                    "category": "Behavior",
                    "competency": "Effective facilitator and presenter.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Runs effective team meetings.",
                      "2": "Is able to present topics to groups of people outside of your immediate team, and participates actively in leadership meetings. Speaks clearly and engages the audience.",
                      "3": "Drives larger strategic meetings, and effectively presents internally to large groups (i.e. All Platform Team Meeting).",
                      "4": "Presents externally to industry peers, partners, and FOCs."
                    },
                    "rating": "",
                    "comment": ""
                },
                "D5": {
                    "category": "Behavior",
                    "competency": "Clear and concise communicator.",
                    "examples": {
                      "0": "Working on gaining the skills/experience needed for this competency.",
                      "1": "Uses basic communication skills (physiology, tone, and words) to effectively deliver a message.",
                      "2": "Clearly communicates expectations with both the team and individual Team Members.",
                      "3": "Ensures that there is clear visibility into the team's commitments for all interested parties, and that team members are communicating in a \"gump\" fashion.",
                      "4": "Clearly communicates across the FOC, and ensures that messages are crafted so that the entire audience can understand them."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
