{
  "version": "1.0.0",
  "type": "Learning Coordinator ",
  "id": "",
  "name": "",
  "updated": "",
  "sections": {
    "Coordination": {
      "competencies": {
        "1": {
          "category": "Behavior",
          "competency": "Maintains stock of learning materials including workbooks, reference documents, promotional materials, and any additional materials needed for class activities.",
          "examples": {
            "0": "Maintains stock of learning materials with reminders from the team.",
            "1": "Maintains stock of learning materials and has identified a reordering cadence.",
            "2": "Autonomously maintains stock of learning materials and asks for reviews to be conducted on learning materials.",
            "3": "Autonomously maintains and replenishes learning materials during identified cadence, also drives discussions to review and update learning materials with facilitators."
          },
          "rating": "",
          "comment": ""
        },
        "2": {
          "category": "Behavior",
          "competency": "Schedules Tech U instructor-led classes. ",
          "examples": {
            "0": "Schedules instructor-led classes with reminders from team, including booking rooms, creating invitations in team Outlook calendar, creating LMS class information, and responding to facilities about room arrangement.",
            "1": "Creates onsite and remote invitations in team Outlook calendar, maintains accurate class information in LMS with class information.",
            "2": "Autonomously schedules instructor-led classes.",
            "3": "Creates and updates documentation on how to autonomously schedule instructor-led classes."
          },
          "rating": "",
          "comment": ""
        },
        "3": {
          "category": "Skill",
          "competency": "Coordinates Tech U training room schedule.",
          "examples": {
            "0": "Coordinates all room requests for the Tech U training room including blocking off the time in MeetingPlanner and our team calendar with reminders from the team.",
            "1": "Autonomously updates both tools for meeting room reservation requests.",
            "2": "Supports Tech U partnerships when rooms are needed or assists in finding other rooms. ",
            "3": "Drives partnerships when rooms are needed and actively engages with Focus to find other training rooms when applicable."
          },
          "rating": "",
          "comment": ""
        },
        "4": {
          "category": "Skill",
          "competency": "Develops onboarding groups through various reports and increase awareness with facilitators on remote participants.",
          "examples": {
            "0": "Utilizes new hire report to identify new team members to Technology and registers team members for onboarding with support.",
            "1": "Autonomously registers team members for onboarding including identifying remote team members, and rescheduling team members that are unable to make onboarding sessions.",
            "2": "Autonomously identifies remote team members to ensure dial-in information and class materials are provided and identifies drivers to assist with facilitation.",
            "3": "Actively reaches out to remote team members to ensure they are prepared for learning. Drives partnership with ICISMs reporting team to ensure the data is accurate."
          },
          "rating": "",
          "comment": ""
        },
        "5": {
          "category": "Skill",
          "competency": "Conducts planning meetings to schedule instructor-led learning offerings.",
          "examples": {
            "0": "Schedules the instructor-led class planning meeting with the team, participates in discussion, and brings copies of reporting or data to make recommendations for specific learning offerings.",
            "1": "Drives the team learning planning meeting and creates Outlook calendar entries of learning offerings and makes adjustments as needed with reminders from the team.",
            "2": "Autonomously schedules and drives the team learning planning meeting. Prepares mock up of recommended learning schedule for upcoming month to expedite the planning process. ",
            "3": "Creates and updates documentation on how to conduct instructor-led planning meetings. Identifies opportunities to improve the planning process. "
          },
          "rating": "",
          "comment": ""
        },
        "6": {
          "category": "Behavior",
          "competency": "Coordinates team meetings.",
          "examples": {
            "0": "Schedules and sets up team meetings including taking notes and posting the agenda in the room with support from the team.",
            "1": "Autonomously schedules and sets up team meetings. Updates agenda in meeting invite, participates in meeting discussion and summarizes action items.  ",
            "2": "Drives communication with the team to update agenda items and action items assigned in previous discussions.",
            "3": "Autonomously maintains team meeting information and seeks opportunities to share knowledge on coordinating team meetings.  "
          },
          "rating": "",
          "comment": ""
        }
      }
    },
    "Networking": {
      "competencies": {
        "7": {
          "category": "Skill",
          "competency": "Maintains and updates the Tech U website calendar.",
          "examples": {
            "0": "Updates and maintains the calendar on team website with support and reminders from the team or leader.",
            "1": "Autonomously updates and maintains the calendar one month in advance.  ",
            "2": "Autonomously updates and maintains the calendar two months in advance. ",
            "3": "Seeks opportunities to share knowledge on how to maintain and update the calendar on team website. Also looks for opportunities to learn new techniques and automate calendar maintenance and updates."
          },
          "rating": "",
          "comment": ""
        }
      }
    },
    "Development ": {
      "competencies": {
        "8": {
          "category": "Behavior",
          "competency": "Establishes Tech U partnerships to create and develop learning, outcomes, and activities.",
          "examples": {
            "0": "Attends meetings and participates in the discussion to create and develop learning, outcomes and activities.",
            "1": "Participates and engages in the discussion to create and develop learning, outcomes and activities by making suggestions and providing input.",
            "2": "Actively seeks out opportunities to engage in the creation and development of learning, outcomes and activities. If prompted, will write outcomes and take on tasks to contribute to developing the learning.",
            "3": "Actively seeks out opportunities to engage in the creation and development of learning, outcomes and activities by bringing suggested drafts of outcomes or plans on how they can contribute to development projects."
          },
          "rating": "",
          "comment": ""
        }
      }
    },
    "Analysis": {
      "competencies": {
        "9": {
          "category": "Skill",
          "competency": "Monitors and updates Tech U Cherwell tickets by communicating with team and requestors.",
          "examples": {
            "0": "Monitors Cherwell tickets for Tech U with reminders from the team or team leader.",
            "1": "Actively monitors Cherwell and responds to clients within one business day.",
            "2": "Updates documentation to provide insight for the entire team and informs the team when there is a new request.",
            "3": "Utilizes Cherwell to connect team members with internal and external learning resources and partners with the team on new requests to learn how needs analyses are conducted."
          },
          "rating": "",
          "comment": ""
        }
      }
    }
  }
}
