{
    "_comment": "https://confluence/display/TRAC/Technical+Writer",

    "type": "Technical Writer",
    "version": "1.0.0",

    "id": "",
    "name": "",
    "updated": "",

    "sections": {
        "Audience": {
            "competencies": {
                "AU1": {
                    "category": "Skill",
                    "competency": "Seeks to understand the needs of the intended audience when creating content and technical writing tools. Validates that the content created meets the intended audience's needs throughout the development life cycle. For example, they spend time in the audience's workspace regularly throughout development to gain perspective.",
                    "examples": {
                        "0": "0 - Works with experienced team members to understand the value of identifying needs and validating usefulness throughout the development life cycle.",
                        "1": "Works with experienced team members when creating content and tools to validate usefulness throughout the development life cycle.  When creating content and tools independently, asks about the audience's needs during the initial discussions with stakeholders only, rather than throughout the development life cycle.  Validates the content/tool's usefulness for the audience with peers only, rather than with the audience.",
                        "2": "Digs deeply with stakeholders when creating content and tools to identify the audience's background and needs during the initial project discussions. Validates the content/tool's usefulness for the audience with stakeholders and peers only, rather than with the audience.",
                        "3": "Digs deeply with stakeholders and the audience when creating content and tools to identify the audience's background, existing knowledge, and needs during the initial project discussions. Validates the content/tool's usefulness for the audience with stakeholders, peers, and all audiences. Drives team project initiatives around audience validation. Regularly seeks feedback from the audience throughout the development life cycle (i.e., before, during, and after publication)."
                    },
                    "rating": "",
                    "comment": ""
                },
                "AU2": {
                    "category": "Behavior",
                    "competency": "Conveys information using the content type(s) appropriate for the audience's needs.",
                    "examples": {
                        "0": "0 - Works with experienced team members to understand how an audience's needs influence choices for the appropriate content type.",
                        "1": "Works with experienced team members to identify the content type(s) appropriate for the audience's needs, when creating content. When creating content independently, creates content based on the initial stakeholder request, offering no personal expertise on the appropriate content type.",
                        "2": "When creating content, works with the stakeholder(s) and audience(s) to determine the appropriate content type using their personal expertise. Creates a single \"one-size-fits-all\" solution for multiple audiences.",
                        "3": "When creating content, works with the stakeholder(s) and audience(s) to determine the appropriate content type(s) using their personal expertise. Ensures all an audience's needs are met by the content type(s) created. Drives team project initiatives around meeting an audience's needs through content type."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Usability": {
            "competencies": {
                "U1": {
                    "category": "Skill",
                    "competency": "Structures content logically and comprehensively. Provides the information in a format and organizational structure so that the reader can easily and quickly obtain the information they need.",
                    "examples": {
                        "0": "Works with experienced team members to understand the importance and impact of content structure.",
                        "1": "Works with experienced team members when creating content to ensure that it is structured logically and comprehensively.  When working independently, takes logic into consideration, but does not always structure content appropriately. For example, leaves instructional steps combined or out of sequence, or leaves results included as steps.  Ensures that high-level concepts are provided prior to details.",
                        "2": "Works independently to create content.  Structures content in a logical format for consumption by first-time readers only.  Instructional steps are listed in order, information is presented in order of most important to least important, and/or high-level concepts are provided prior to details.",
                        "3": "Works independently to create content. Structures content in a logical format for consumption, both for first-time readers as well as long-term use as reference later. Instructional steps are listed in order, information is presented in order of most important to least important, and/or high-level concepts are provided prior to details. Regularly seeks opportunities to improve the structure of existing content. Drives team project initiatives around content structure."
                    },
                    "rating": "",
                    "comment": ""
                },
                "U2": {
                    "category": "Behavior",
                    "competency": "Creates consistency by making and using templates for related content and repeatable processes.",
                    "examples": {
                        "0": "Works with experienced team members to understand how and when to create and use templates.",
                        "1": "Works with experienced team members when building content to determine if there are existing templates to use, and to create templates when needed. ",
                        "2": "Encourages consistency by creating and sharing templates with their teammates and other content creators.",
                        "3": "Encourages consistency by creating and sharing templates with their teammates and other content creators. Regularly seeks opportunities to use, enhance, and create templates. Drives team initiatives around template creation and use."
                    },
                    "rating": "",
                    "comment": ""
                },
                "U3": {
                    "category": "Behavior",
                    "competency": "Develops content using standard styles, utilizing and creating appropriate style guides as needed.",
                    "examples": {
                        "0": "Works with experienced team members to understand the benefits of using styles and how to create them, and how to utilize style guides.",
                        "1": "Works with experienced team members to utilize style guides when developing content.",
                        "2": "Creates content using standards from both internal and external style guides.",
                        "3": "Creates content using standards from both internal and external style guides. Regularly looks for opportunities to enhance internal style guides. Drives team project initiatives around style guide creation and enhancement."
                    },
                    "rating": "",
                    "comment": ""
                },
                "U4": {
                    "category": "Behavior",
                    "competency": "Formats content consistently. For example, instructions are listed as numbered steps. Headings are worded in parallel with each other (e.g., they all begin with a verb). Items in a numbered or bulleted list are worded in parallel with other items in the same list. Headings clearly indicate the content within. Lists that are not ranked, ordered, or sequential steps are bulleted.",
                    "examples": {
                        "0": "Works with experienced team members to understand content formatting and it's impact on readers.",
                        "1": "Works with experienced team members to format content consistently.",
                        "2": "Creates consistently formatted content.",
                        "3": "Creates consistently formatted content. Regularly seeks opportunities to improve existing content by re-formatting it consistently. Drives team initiatives around consistent content formatting."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Reusability": {
            "competencies": {
                "R1": {
                    "category": "Behavior",
                    "competency": "Seeks existing content that may be reused and/or modified before creating new content.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of reusing and modifying existing content.",
                        "1": "Reuses existing content only if told by experienced team members that it exists and where. Creates new content if they are told none exists.",
                        "2": "Works independently to find existing content.  Creates new content if they are unable to find any existing content. Reuses and modifies existing content if found. Copies and pastes information being reused.",
                        "3": "Works independently to find existing content. Creates new content if they are unable to find any existing content. Reuses and modifies existing content if found. Utilizes the appropriate tools to redisplay information whenever possible. When tools are unavailable, provides links to existing information rather than copying and pasting. Drives team project initiatives around reusing existing content, rather than always creating new content."
                    },
                    "rating": "",
                    "comment": ""
                },
                "R2": {
                    "category": "Skill",
                    "competency": "Creates content in such a way that the information can be reused for other purposes.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of creating reusable content.",
                        "1": "Creates content that can be reused for multiple purposes, and/or multiple audiences if needed.",
                        "2": "Creates content in small chunks that can be reused for multiple purposes, and/or multiple audiences, if needed.",
                        "3": "Creates content in small chunks that can be reused for multiple purposes, and/or multiple audiences, if needed. Regularly seeks opportunities to improve existing content by making reusability suggestions to others. Drives team project initiatives around building content for reuse."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Simplicity": {
            "competencies": {
                "S1": {
                    "category": "Skill",
                    "competency": "Seeks to understand the challenge to be solved when creating content, and focuses on solving that quickly using Minimum Viable Product (MVP) solutions, without increasing scope.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of creating MVP solutions.",
                        "1": "Requests solutions from the stakeholder(s), produces those solutions, then presents them to the stakeholder(s) (i.e., they act as an order taker). Solution is overly complex or includes unnecessary content. When a stakeholder changes or adds to the scope of work, it is incorporated without discussing the value, feasibility, and additional time/risk that may be involved.",
                        "2": "Works with the stakeholder(s) to fully understand the challenge to be solved. Uses their teammates' expertise to help design creative MVP solutions, and presents them to the stakeholder(s) as recommendations.  Works iteratively with the stakeholder(s) to create solutions and regularly gathers and incorporates their feedback.   When a stakeholder changes or adds to the scope of work, the value, feasibility, and additional time/risk involved are discussed with the stakeholder(s) and when not critical, are reserved for future work.",
                        "3": "Works with the stakeholder(s) to fully understand the challenge to be solved. Uses their own expertise to help design creative MVP solutions, and presents them to the stakeholder(s) as recommendations. Works iteratively with the stakeholder(s) to create solutions and regularly gathers and incorporates their feedback. When a stakeholder changes or adds to the scope of work, the value, feasibility, and additional time/risk involved are discussed with the stakeholder(s) and when not critical, are reserved for future work. Drives team project initiatives around requirements gathering and designing MVP solutions."
                    },
                    "rating": "",
                    "comment": ""
                },
                "S2": {
                    "category": "Behavior",
                    "competency": "Creates \"gump\" content using the most simple language possible, avoids needless complexity, and avoids ambiguity.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of making content \"gump,\" and techniques for creating it.",
                        "1": "Works with experienced team members when creating content to make it \"gump.\" When working independently, uses content as a vehicle for creative self-expression. Some language chosen is overly complex or too formal for the audience. Readers need to reread the content more than once to understand it.",
                        "2": "Creates \"gump\" content using simple language and only includes jargon they believe the audience will understand.  Readers understand the content when reading it for the first time.",
                        "3": "Creates \"gump\" content using simple language and only includes jargon the audience is certain to understand. Readers immediately understand the content upon reading it for the first time, and can easily find the information they need for reference later. Verifies clarity with the audience before publication. Drives team project initiatives around creating \"gump\" content."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Language": {
            "competencies": {
                "L1": {
                    "category": "Behavior",
                    "competency": "When creating content, clearly indicates desired actions for the audience to take.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of clearly indicating desired actions to an audience when creating content.",
                        "1": "Works with experienced team members when creating content, to clearly indicate desired actions to an audience. When working independently, phrases information so that the audience understands what not to do, but is unclear about the action(s) they should take.",
                        "2": "When creating content, clearly indicates the desired actions to the audience.",
                        "3": "When creating content, clearly indicates the desired actions to the audience. Phrases information in such a way that the audience is inspired to take the desired action, rather than using fear of consequences as motivation. Drives team project initiatives around content clarity."
                    },
                    "rating": "",
                    "comment": ""
                },
                "L2": {
                    "category": "Skill",
                    "competency": "When creating content, uses appropriate grammar, phrasing, and spelling for the content type, purpose, and audience.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of using appropriate grammar, phrasing, and spelling for the content type, purpose, and audience.",
                        "1": "Works with experienced team members when creating content to use appropriate grammar, phrasing, and spelling for the content type, purpose, and audience. When working independently, applies basic grammar best practices. Uses conversational phrasing when creating instructional content.",
                        "2": "Considers the content type, purpose, and audience when creating solutions.   Applies appropriate grammar, phrasing, and spelling to achieve content goals.    Consults the appropriate existing style guides when needed.",
                        "3": "Considers the content type, purpose, and audience when creating solutions.  Applies the appropriate grammar, phrasing, and spelling to achieve the content goals. Consults the appropriate existing style guides when needed and applies the recommended style(s). Modifies existing style guides as new scenarios are identified and decisions are made. Drives team project initiatives around using appropriate grammar, phrasing, and spelling for the content type, purpose, and audience."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Tools": {
            "competencies": {
                "T1": {
                    "category": "Skill",
                    "competency": "Can create a variety of content types including user guides, policies, procedures, process flows, and articles.",
                    "examples": {
                        "0": "Works with experienced team members to understand the techniques used to edit different content types.",
                        "1": "Familiar with a few different content types and their intended purposes. Only edits those independently, and works with experienced team members for any other types.",
                        "2": "Creates a variety of content types independently.",
                        "3": "Creates a variety of content types independently. Applies best practices for each content type. If creating a new content type, researches best practices and recommendations for that type. Drives team project initiatives around improving existing content types, and introducing new types."
                    },
                    "rating": "",
                    "comment": ""
                },
                "T2": {
                    "category": "Knowledge",
                    "competency": "Proficient in creating content in a variety of tools such as Microsoft Word, Visio, and Atlassian Confluence.",
                    "examples": {
                        "0": "Works with experienced team members to understand the various content creation tools used in QL Technology.",
                        "1": "Familiar with many creation tools used in QL Technology, but uses only one or two independently. Creates content in familiar tools, then imports it into unfamiliar tools, rather than creating it in the unfamiliar tool. Works with experienced team members for best practices when using tools they are less familiar with. ",
                        "2": "Expert in one or two content creation tools used in QL Technology, but familiar with all of them.  Chooses the appropriate tool to use because it is the best solution for the challenge, rather than familiarity.    Mentors other teammates in the use of content creation tools.   Creates \"how to\" content for those tools when needed.",
                        "3": "Expert in all content creation tools used in QL Technology. Chooses the appropriate tool to use because it is the best solution for the challenge, rather than familiarity. Mentors other teammates in the use of content creation tools. Creates \"how to\" content when needed. Drives team initiatives around improving content creation tool usage."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Growth": {
            "competencies": {
                "G1": {
                    "category": "Behavior",
                    "competency": "Shares technical writing best practices and industry recommended techniques with other content authors to improve their writing.",
                    "examples": {
                        "0": "Works with experienced team members to understand writing best practices and techniques.",
                        "1": "Mentors teammates and other content authors with whom they have developed relationships by providing constructive and positive feedback on their writing, when requested. Validates their techniques and recommendations to others with experienced team members. Seeks new techniques and industry recommendations from teammates, rather than independent research. Updates their own practices based on these recommendations.",
                        "2": "Mentors teammates and other content authors by providing constructive and positive feedback on their writing, including those they may not have developed relationships with, when requested.  Seeks new techniques and industry recommendations through independent research. Updates their own practices based on these recommendations.",
                        "3": "Mentors teammates and other content authors by providing constructive and positive feedback on their writing, including those they may not have developed relationships with, even when it has not been specifically requested. Seeks new techniques and industry recommendations through independent research. Updates their own practices regularly, based on these recommendations. Feels fully confident in their expertise. Drives team project initiatives around helping content authors improve their writing."
                    },
                    "rating": "",
                    "comment": ""
                },
                "G2": {
                    "category": "Knowledge",
                    "competency": "Regularly seeks internal and external resources for information that will improve the role and the team's work, such as new techniques, processes, and tools.",
                    "examples": {
                        "0": "Works with experienced team members to understand internal and external resources for information.",
                        "1": "When asked, reviews industry resources and SME websites and books and discusses them with the team.",
                        "2": "Regularly reviews industry resources and SME websites and books.  Presents recommendations to the team about ways the team can improve their work using new techniques/processes/tools. Works with experienced team members to implement changes.",
                        "3": "Regularly reviews industry resources and SME websites and books. Fully researches the benefits of using a new technique/process/tool, and presents recommendations to the team about ways the team can improve their work using the new techniques/processes/tool. Drives team project initiatives to implement changes. Ensures that improvements are future-proof."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Collaboration": {
            "competencies": {
                "CO1": {
                    "category": "Behavior",
                    "competency": "Works closely with other technical communication team members (e.g., Holocron, Content Strategy, Digital Asset Management (DAM), Tech U, Technical Writers, and Knowledge Management Specialists) to improve content creation, storage, maintenance, and sharing. ",
                    "examples": {
                        "0": "Works with experienced team members to understand other technical communication roles. Works with experienced team members to understand options for content creation, storage, maintenance, and sharing within QL Technology. Works to develop relationships with other technical communication team members.",
                        "1": "When opportunities are observed within QL Technology, works with experienced team members and other technical communication team members to improve content creation, storage, maintenance, and sharing. Has established relationships with other technical communication-focused team members.",
                        "2": "When opportunities are observed within QL Technology, collaborates with other technical communication team members to improve content creation, storage, maintenance, and sharing.   When requested, provides their own input and expertise to other technical communication team members to improve knowledge sharing across the FOC. Maintains collaborative relationships with other technical communication-focused team members.",
                        "3": "Regularly seeks opportunities to collaborate with other technical communication team members to improve content creation, storage, maintenance, and sharing across the FOC. Provides input and expertise to other technical communication team members to improve knowledge sharing. Maintains collaborative relationships with other technical communication-focused team members. Drives team project initiatives around collaboration with other technical communication roles in the FOC to improve knowledge sharing."
                    },
                    "rating": "",
                    "comment": ""
                },
                "CO2": {
                    "category": "Knowledge",
                    "competency": "Knowledgeable about various life cycles used for documentation and software development (e.g., DDLC and SDLC).",
                    "examples": {
                        "0": "Works with experienced team members to understand the industry standard life cycles.",
                        "1": "Understands the industry standard life cycles.",
                        "2": "Understands the industry standard life cycles and how they are applied within QL Technology.",
                        "3": "Has extensive knowledge about industry standards and how they are applied within QL Technology. Regularly seeks opportunities to improve the way teams implement DDLCs. Drives team project initiatives around improving QL Technology's use of DDLCs."
                    },
                    "rating": "",
                    "comment": ""
                },
                "CO3": {
                    "category": "Skill",
                    "competency": "Incorporates agile practices and priorities into their own work, and the team's work. These practices and priorities include working iteratively, failing fast, stakeholder collaboration over scope negotiation, and responding to change over following a plan.",
                    "examples": {
                        "0": "Attends stand-ups and other agile ceremonies. Works iteratively when asked to do so.",
                        "1": "Prioritizes working iteratively and accommodating changing needs, over adherence to ceremonies.",
                        "2": "When asked, shares knowledge with teammates on working iteratively and accommodating changing needs, over adherence to ceremonies.",
                        "3": "Regularly seeks opportunities to share knowledge with teammates on working iteratively and accommodating changing needs, over adherence to ceremonies. Drives team project initiatives around working iteratively, failing fast, stakeholder collaboration over scope negotiation, and responding to change over following a plan."
                    },
                    "rating": "",
                    "comment": ""
                },
                "CO4": {
                    "category": "Behavior",
                    "competency": "Communicates regularly and clearly with stakeholders about project expectations, deadlines, statuses, and feedback.",
                    "examples": {
                        "0": "Provides updates to stakeholders when requested.",
                        "1": "Provides updates to stakeholders less than every two weeks throughout the project and requests feedback.",
                        "2": "At the project inception, sets clear expectations with the stakeholders about communication time frames and needs. Provides updates to stakeholders, and requests feedback from stakeholders at a regular cadence more often than every two weeks throughout the project.",
                        "3": "At the project inception, sets clear expectations with the stakeholders about communication time frames and needs. Throughout the project, provides stakeholders with updates about progress and requests feedback at a regular cadence. Allows no more than a couple of business days to go by without communicating with stakeholders. Regularly seeks opportunities to share knowledge with teammates about stakeholder communication. Drives team project initiatives around stakeholder communication."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        },
        "Accuracy": {
            "competencies": {
                "A1": {
                    "category": "Skill",
                    "competency": "When creating content, seeks knowledge from a variety of sources to ensure content accuracy.",
                    "examples": {
                        "0": "Works with experienced team members to understand the value of using multiple knowledge sources for ensuring content accuracy.",
                        "1": "Works with experienced team members to use multiple knowledge sources for ensuring content accuracy. When creating content independently, uses knowledge gained from the stakeholder(s) and teammates.",
                        "2": "Creates content using knowledge gained from the stakeholder(s) and teammates, as well as independent research found through alternative resources, such as SME websites or books.",
                        "3": "Creates content using knowledge gained from the stakeholder(s) and teammates, as well as independent research found through alternative resources, such as SME websites or books. Drives team project initiatives around content research and accuracy verification."
                    },
                    "rating": "",
                    "comment": ""
                }
            }
        }
    }
}
